[

    {
        "id": 1,
        "title": "Shiqi AI tools",
        "description": "Discover our collection of intelligent AI tools designed to boost your productivity, creativity, and efficiency. Each kit is crafted with cutting-edge technology to solve real-world challenges.",
        "image": "/shiqi-ai-tools.png",
        "technologies": [
            "Cursor",
            "AI",
            "Next.js",
            "Tailwind CSS"
        ],
        "demoLink": "https://shiqi-ai-tools.vercel.app/"
    },
    {
        "id": 2,
        "title": "StudyHub",
        "description": "It's an intelligent, chat-based platform for managing documents and files. Users can ask questions in natural language, and the system returns accurate answers along with three relevant resources based on the question. It also offers secure authentication, rich content creation, and smart, semantic search-driven recommendations",
        "image": "/studyhub.png",
        "technologies": [
            "LLM/OpenAI API",
            "Angular19",
            "Express",
            "Tailwind CSS",
            "Material UI"
        ],
        "demoLink": "https://github.com/ShiqiP/StudyHub-LLM-Angular-Express-MongoDB-Atlas"
    },
    {
        "id": 5,
        "title": "Paperless Conference System (Web development Frontend)",
        "description": "This is an advanced meeting and collaboration platform tailored for professional environments. Designed to enhance productivity in enterprise scenarios, it combines real-time collaboration tools with seamless user management and interactive document handling. This is a ToB product, and the version shown includes only the public-facing features.",
        "image": "/paperless.jpeg",
        "technologies": [
            "React",
            "Redux",
            "Vue",
            "WebSocket",
            "CSS"
        ],
        "demoLink": "https://www.linkedin.com/posts/dsppa-audiovisual-09120b103_dsppa-paperlessconferencesystem-conferencetech-activity-7321080324015243264-cL7N/?utm_source=share&utm_medium=member_desktop&rcm=ACoAAEpfkC4B5DTS5jnFw-dp0liX1HbL2Qs1NQs"
    },
    {
        "id": 10,
        "title": "MIU Policy",
        "description": "This is a full-stack academic project designed to streamline the management and presentation of institutional policies. It features a secure authentication system, a rich text editing interface, and a structured policy catalog.",
        "image": "/miu-policy.png",
        "technologies": [
            "React",
            "Node.js",
            "Express",
            "Tailwind CSS"
        ],
        "demoLink": "https://github.com/ShiqiP/express-react-policy-project"
    },
        {
        "id": 12,
        "title": "Plantyx",
        "description": "Over the past few days, I’ve been working on implementing a clean and modern web prototype I found on Figma. I used Next.js, Tailwind CSS, and custom CSS to bring it to life. It's responsive layout that works smoothly on both desktop and mobile",
        "image": "/plantyx.png",
        "technologies": [
            "Tailwind CSS",
            "Next.js",
            "Figma",
            "Pixel-perfect"
        ],
        "demoLink": "https://shiqip.github.io/plantyx"
    }
]